package main

import (
	"log"

	"github.com/go-telegram-bot-api/telegram-bot-api"
)

const myId = 227605930
const botToken = "371494091:AAGndTNOEJpsCO9_CxDuPpa9R025Lxms6UI"

func main() {
	bot, err := tgbotapi.NewBotAPI(botToken)
	if err != nil {
		return
	}

	_, err = bot.Send(tgbotapi.NewMessage(57813058, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(244489778, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}

	_, err = bot.Send(tgbotapi.NewMessage(248239658, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(243429867, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(185802556, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(107950408, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(149906245, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(94943173, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}

	_, err = bot.Send(tgbotapi.NewMessage(218567363, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(204767177, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}

	_, err = bot.Send(tgbotapi.NewMessage(693712, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(338030847, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}

	_, err = bot.Send(tgbotapi.NewMessage(245090894, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}

	_, err = bot.Send(tgbotapi.NewMessage(250493282, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}

	_, err = bot.Send(tgbotapi.NewMessage(221524772, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(70167980, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}

	_, err = bot.Send(tgbotapi.NewMessage(254438520, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}

	_, err = bot.Send(tgbotapi.NewMessage(161872635, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}

	_, err = bot.Send(tgbotapi.NewMessage(45832584, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}

	_, err = bot.Send(tgbotapi.NewMessage(142080444, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(61219035, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(200867264, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(258816282, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(258540109, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(238697588, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(197173402, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(200874470, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(215065513, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(245647624, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(129363483, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(270519216, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(1469626, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(172833377, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}

	_, err = bot.Send(tgbotapi.NewMessage(80540810, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(65335426, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}

	_, err = bot.Send(tgbotapi.NewMessage(188043701, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	_, err = bot.Send(tgbotapi.NewMessage(269879466, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать пользоваться удобным интерфейсом! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

	if err != nil {
		log.Print(err)
	}
	if err != nil {
		log.Print(err)
	}

	bot.Send(tgbotapi.NewMessage(myId, "Ура! Поставлено новое обновление, оно не оставит Вас равнодушным! Теперь Вы можете уйти от надоедливого нажимания клавишь клавиатуры и начать использовать удобный интерфейс! Советую всем ввести комманду /keyboard, это упростит Вам жизнь."))

}
